/*****************************************************************************
 *      ソフトウェアライブラリ
 *
 *      Copyright (c) 1994 SEGA
 *
 * Library: ファイルローダ
 * Module : サンプル１
 * File   : smpfld01.c
 * Date   : 1996-02-28
 * Version: 1.21
 * Author : N.K
 *
 *      ゲームの単純な起動。
 *
 *****************************************************************************/

/*****************************************************************************
 *      インクルードファイル
 *****************************************************************************/
#include <sega_sys.h>
#include <sega_gfs.h>
#include <fld_load.h>

/*****************************************************************************
 *      定数マクロ
 *****************************************************************************/
/* 同時にオープンするファイルの数 */
#define MAX_OPEN        2

/* ルートディレクトリにあるファイル数 */
#define MAX_DIR         10

/* 起動するゲームのIPファイル名 */
#define FNAME           "SAMP_IP.BIN"

/* 起動するゲームが格納されているサブディレクトリ名 */
#define DIRNAME         "SAMP"

/* 起動するゲームが使用するCD-DAトラックの、先頭トラック番号 */
#define CDDA_TNO_OFFSET  (2)

/*****************************************************************************
 *      関数の宣言
 *****************************************************************************/
/*****************************************************************************
 *      変数の定義
 *****************************************************************************/
/* ライブラリ作業領域 */
Uint32 lib_work[GFS_WORK_SIZE4(MAX_OPEN)];

/* ディレクトリ情報管理領域 */
GfsDirTbl dirtbl; 

/* ディレクトリ情報格納領域 */
GfsDirName dirname[MAX_DIR];

/*****************************************************************************
 *      関数の定義
 *****************************************************************************/
Sint32 main(void)
{
    Sint32 ret;
	Sint32 tno = CDDA_TNO_OFFSET;	/* 起動するゲームで使用する CD-DA の
									   先頭のトラック番号 */

    /* ディレクトリ情報管理領域のsetup */
    GFS_DIRTBL_TYPE(&dirtbl) = GFS_DIR_NAME;
    GFS_DIRTBL_DIRNAME(&dirtbl) = dirname;
    GFS_DIRTBL_NDIR(&dirtbl) = MAX_DIR;

    /* ファイルシステムの初期化 */
    FLD_INIT_DDS();
    ret = GFS_Init(MAX_OPEN, lib_work, &dirtbl);
    if (ret <= 0) {
		/*	失敗すると、自分自身を起動する */
		SYS_Exit(0);
    }

    /* ゲームを起動する */
	ret = FLD_ExecGame(FNAME, DIRNAME, tno);
	if (ret != OK) {
		/*	失敗すると、マルチプレイヤーに戻る */
		SYS_Exit(1);
	}
    return 0;
}
